import {ActionRowBuilder, ButtonBuilder, ButtonStyle, ChatInputCommandInteraction, EmbedBuilder} from "discord.js";
import User from "../../Entities/User.entity";
import {ILangProps} from "../../types/interfaces/ILang";

export default async function rules(interaction: ChatInputCommandInteraction, user: User, locale: ILangProps) {


    const embed = new EmbedBuilder()
        .setTitle("📚 Game Rules")
        .setDescription("The rules of the game.")
        .setFields({
            name: "Basic rules",
            value: "The flow of the game is controlled by bot, who also gives roles to players."
        }, {
            name: "Night time",
            value: "dsfs",
        }, {
            name: "Day time",
            value: "dsfs",
        })
        .setColor("#329fff")
    const embed2 = new EmbedBuilder()
        .setTitle("Roles")
        .setDescription("This includes description only for standard roles, for the custom roles see in scripting help and profiles of owners.")
        .setFields({
            name: locale.role_mafia_name,
            value: "This is a group role, each night they kill one person together. Wins when their count of players multiplied by and added 1 is more than total count of alive players."
        },{
            name: locale.role_mistress_name,
            value: "fsdfsd"
        },{
            name: locale.role_police_name,
            value: "sfsdf"
        },{
            name: locale.role_killer_name,
            value: "fsddfsdfs"
        },{
            name: locale.role_doctor_name,
            value: "fsfdssdf"
        },{
            name: locale.role_peaceful_name,
            value: "dsfsdf"
        })

    interaction.reply({ephemeral: true, embeds: [embed, embed2]});
}

// Хід гри в Мафію контролює Ведучий. Він роздає учасникам карти Мафії, що визначають ролі учасників.
//
//     Гравці умовно діляться на групи: «Червоні» та «Чорні»:
//
// До «Червоним» відносяться «Мирні жителі», «Шериф», «Доктор», «Маніяк» і «Леді".
// До «Чорним» відносяться «Мафія» і глава мафії «Дон».
//
// Ігровий процес розділений на дві фази - «день» і «ніч». Коли ведучий оголошує: «Настає ніч», гравці закривають очі масками і нахиляють голови вниз, щоб руху сусідів або гра тіней не стали джерелом додаткової інформації для них.
//
//     В першу ніч ведучий дозволяє гравцям з картами «Мафії» - розплющити очі і запам'ятати своїх соратників - «познайомитися». Після чого мафія «засинає».
//
// Коли настає фаза дня - прокидаються всі жителі. Вдень гравці обговорюють, хто з них може бути «нечесний» - причетний до мафії. В кінці обговорення ведучим оголошується відкрите голосування. Найбільш підозрілий житель, який набрав більшу кількість голосів - виходить з гри, а ведучий розкриває його карту і оголошує ігровий статус.
//
//     Потім настає фаза «ночі». У цій фазі під керівництвом провідного прокидаються всі активні ролі і роблять свій вибір.
//
//     Вночі прокидається мафія, беззвучно (жестами) «радиться» і вбиває одного з городян, вказуючи на нього ведучому. Якщо мафія не може прийняти рішення узгоджено, то вибір робить "Дон". Мафія засинає.
//
//     Прокидається ДЕТЕКТИВ і вказує на одного з жителів, якого бажає «перевірити» на причетність до мафії. «Ведучий» кивком голови або підтверджує його версію, або заперечує. Також у детектива є право «шаленого пострілу», тобто можна вбити без перевірки, один раз за всю гру.
//
//     Також залежно від кількості людей правила гри в мафію можуть адаптуватися, і за ігровим столом уночі можуть прокидатися такі активні ролі:
//
//     ▪️ ДОКТОР - грає за мирних жителів. «Доктор» відкриває очі і вказує на одного з гравців, в надії врятувати того, хто загинув від рук мафії. Може лікувати тільки від одного вбивства (тобто якщо в гравця стріляли кілька разів, то доктор в такому випадку лікує тільки від одного пострілу і гравець вмирає). Доктор може лікувати себе не більше двох разів протягом гри.
//
// ▪️ МАНІЯК або Серійний вбивця - грає за мирних жителів. Вночі прокидається і на свій розсуд стріляє в гравця, якого вважає мафією. Завдання вбити мафію. Утриматися від пострілу не можна.
//
// ▪️ ЛЕДІ (також поширена назва «путана») - грає за мирних жителів. Вночі прокидається і на свій розсуд «заморожує» одного гравця. Цей гравець на один день позбавляється права на обговорення, виправдання і голосування. Завдання леді не дати висловитися мафії.
//
// ▪️ АНГЕЛ СМЕРТІ - активний персонаж, але вночі не прокидається. Грає за мирних жителів. Це роль починає діяти в той момент, коли гравця з цією картою вбили, він своєю чергою може забрати з собою одного з гравців, в надії забрати з собою мафію.
//
//     Вдень ведучий оголошує, хто був убитий вночі. Цей гравець виходить з гри, його карта («статус») показується всім жителям. Якщо гравець грав на «мирної» стороні йому надається останнє слово. Інформація про події, що відбулися використовується залишилися в живих гравцями, для обговорення і чергового «засудження» ... Гра триває до повної перемоги однієї з команд, коли суперники вбиті ...
//
//
//
// Правила поведінки за столом ПРИ ГРІ В МАФІЮ З KAVA.
//
//     Всі гравці повинні беззаперечно дотримуватися правил, поважати інших гравців за ігровим столом, виконувати вказівки ведучого.
//
//     Заборонено:
//
// 1. Підглядати вночі.
//
// 2. Вживати ненормативну лексику, ображати учасників.
//
// 3. вигукували під час денного обговорення поза своєї черги.
//
//     За порушення правил, гравець може отримати зауваження або видалення, на розсуд «Ведучого».